realhonbo/stboot-stm32/src/lib/qspi-flash.c
/***********************************************************************************************************************
	*       @file  	 qspi_w25q64.c
	*       @version V1.0
	*       @date    2022-7-12
	*       @author  反客科技
	*       @brief   QSPI驱动W25Qxx相关函数，提供的读写函数均使用HAL库函数直接操作
   *********************************************************************************************************************
        *       @description
	*	        实验平台：反客STM32H750XBH6核心板 （型号：FK750M5-XBH6）
	*	        淘宝地址：https://shop212360197.taobao.com
	*	        QQ交流群：536665479
>>>>> 文件说明：
	*       1.例程参考于官方驱动文件 stm32h743i_eval_qspi.c
	*	2.例程使用的是 QUADSPI_BK1
	*	3.提供的读写函数均使用HAL库函数直接操作，没有用到DMA和中断
	*	4.默认配置QSPI驱动时钟为120M
>>>>> 重要说明：
	*	1.W25QXX的擦除时间是限定的!!! 手册给出的典型参考值为: 4K-45ms, 32K-120ms ,64K-150ms,整片擦除20S
	*	2.W25QXX的写入时间是限定的!!! 手册给出的典型参考值为: 256字节-0.4ms，也就是 1M字节/s （实测大概在600K字节/s左右）
        *
	*	3.如果使用库函数直接读取，那么是否使用DMA、是否开启Cache、编译器的优化等级以及数据存储区的位置(内部 TCM SRAM 或者 AXI SRAM)都会影响读取的速度
	*	        如果使用内存映射模式，则读取性能只与QSPI的驱动时钟以及是否开启Cache有关
        *
	*	5.使用库函数进行直接读取，keil版本5.30，编译器AC6.14，编译等级Oz image size，读取速度为 7M字节/S ，数据放在TCM SRAM 或者 AXI SRAM
	*               都是差不多的结果，因为CPU直接访问外设寄存器的效率很低，直接使用HAL库进行读取的话，速度很慢
        *
	*	6.如果使用MDMA进行读取，可以达到 58M字节/S，使用内存映射模式的话，几乎可以达到驱动时钟的全速，62.14M/s (133MHz时钟下)
	*               W25Q64JV 所允许的最高驱动频率为133MHz，750的QSPI最高驱动频率也是133MHz ，但是对于HAL库函数直接读取而言，驱动时钟超过15M已经不会有性能提升
	*	  对于内存映射模式直接读取而言，驱动时钟超过127.5M已经不会有性能提升，因为QSPI内核时钟最高限定为250M，所以建议实际QSPI驱动时钟不要超过125M，
	*	        具体的时钟配置请参考 sysclk_config 函数
	*	9.实际使用中，当数据比较大时，建议使用64K或者32K擦除，擦除时间比4K擦除块
	***************************************************************************************************************/
#include <stdio.h>
#include "qspi-flash.h"
#include "stm32h7xx_hal.h"
#include "bsp.h"

QSPI_HandleTypeDef hqspi;	// 定义QSPI句柄，这里保留使用cubeMX生成的变量命名，方便用户参考和移植

/*************************************************************************************************
*	函 数 名: HAL_QSPI_MspInit
*	入口参数: hqspi - QSPI_HandleTypeDef定义的变量，即表示定义的QSPI句柄
*	返 回 值: 无
*	函数功能: QSPI引脚初始化函数
*	说    明: 该函数会被	MX_QUADSPI_Init 函数调用	
*************************************************************************************************/

void HAL_QSPI_MspInit(QSPI_HandleTypeDef* hqspi)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	if(hqspi->Instance==QUADSPI)
	{
		__HAL_RCC_QSPI_CLK_ENABLE();		// 使能QSPI时钟

		__HAL_RCC_QSPI_FORCE_RESET();		// 复位QSPI
		__HAL_RCC_QSPI_RELEASE_RESET();		
		
		GPIO_QUADSPI_CLK_ENABLE;		// 使能 QUADSPI_CLK IO口时钟
		GPIO_QUADSPI_BK1_NCS_ENABLE;	// 使能 QUADSPI_BK1_NCS IO口时钟
		GPIO_QUADSPI_BK1_IO0_ENABLE;	// 使能 QUADSPI_BK1_IO0 IO口时钟
		GPIO_QUADSPI_BK1_IO1_ENABLE;	// 使能 QUADSPI_BK1_IO1 IO口时钟
		GPIO_QUADSPI_BK1_IO2_ENABLE;	// 使能 QUADSPI_BK1_IO2 IO口时钟
		GPIO_QUADSPI_BK1_IO3_ENABLE;	// 使能 QUADSPI_BK1_IO3 IO口时钟
		
		/******************************************************  
		 PG6     ------> QUADSPI_BK1_NCS
		 PF6     ------> QUADSPI_BK1_IO3
		 PF7     ------> QUADSPI_BK1_IO2
		 PF8     ------> QUADSPI_BK1_IO0
		 PF10     ------> QUADSPI_CLK
		 PF9     ------> QUADSPI_BK1_IO1
		*******************************************************/
		
		GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;				// 复用推挽输出模式
		GPIO_InitStruct.Pull 		= GPIO_NOPULL;						// 无上下拉
		GPIO_InitStruct.Speed 		= GPIO_SPEED_FREQ_VERY_HIGH;	// 超高速IO口速度
		
		GPIO_InitStruct.Pin 			= QUADSPI_CLK_PIN;				// QUADSPI_CLK 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_CLK_AF;					// QUADSPI_CLK 复用
		HAL_GPIO_Init(QUADSPI_CLK_PORT, &GPIO_InitStruct);			// 初始化 QUADSPI_CLK 引脚

		GPIO_InitStruct.Pin 			= QUADSPI_BK1_NCS_PIN;			// QUADSPI_BK1_NCS 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_BK1_NCS_AF;			// QUADSPI_BK1_NCS 复用
		HAL_GPIO_Init(QUADSPI_BK1_NCS_PORT, &GPIO_InitStruct);   // 初始化 QUADSPI_BK1_NCS 引脚
		
		GPIO_InitStruct.Pin 			= QUADSPI_BK1_IO0_PIN;			// QUADSPI_BK1_IO0 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_BK1_IO0_AF;			// QUADSPI_BK1_IO0 复用
		HAL_GPIO_Init(QUADSPI_BK1_IO0_PORT, &GPIO_InitStruct);	// 初始化 QUADSPI_BK1_IO0 引脚	
		
		GPIO_InitStruct.Pin 			= QUADSPI_BK1_IO1_PIN;			// QUADSPI_BK1_IO1 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_BK1_IO1_AF;			// QUADSPI_BK1_IO1 复用
		HAL_GPIO_Init(QUADSPI_BK1_IO1_PORT, &GPIO_InitStruct);   // 初始化 QUADSPI_BK1_IO1 引脚
		
		GPIO_InitStruct.Pin 			= QUADSPI_BK1_IO2_PIN;			// QUADSPI_BK1_IO2 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_BK1_IO2_AF;			// QUADSPI_BK1_IO2 复用
		HAL_GPIO_Init(QUADSPI_BK1_IO2_PORT, &GPIO_InitStruct);	// 初始化 QUADSPI_BK1_IO2 引脚			
		
		GPIO_InitStruct.Pin 			= QUADSPI_BK1_IO3_PIN;			// QUADSPI_BK1_IO3 引脚
		GPIO_InitStruct.Alternate 	= QUADSPI_BK1_IO3_AF;			// QUADSPI_BK1_IO3 复用
		HAL_GPIO_Init(QUADSPI_BK1_IO3_PORT, &GPIO_InitStruct);	// 初始化 QUADSPI_BK1_IO3 引脚
	}
}

/*************************************************************************************************
*	函 数 名: MX_QUADSPI_Init
*	入口参数: 无
*	返 回 值: 无
*	函数功能: 初始化 QSPI 配置
*	说    明: 无	
**************************************************************************************************/

void MX_QUADSPI_Init(void)
{
/*在某些场合，例如用作下载算法时，需要手动清零句柄等参数，否则会工作不正常*/	
	uint32_t i;
	char *p;

	/* 此处参考安富莱的代码，大家可以去学习安富莱的教程，非常专业 */
	p = (char *)&hqspi;
	for (i = 0; i < sizeof(hqspi); i++) {
		*p++ = 0;
	}	
	hqspi.Instance  = QUADSPI;   
	HAL_QSPI_DeInit(&hqspi) ;

	hqspi.Instance = QUADSPI;
	/*本例程选择 HCLK 作为QSPI的内核时钟，速度为240M，再经过2分频得到120M驱动时钟，
	  关于 QSPI内核时钟 的设置，请参考 main.c文件里的 sysclk_config 函数*/
	// 需要注意的是，当使用内存映射模式时，这里的分频系数不能设置为0！！否则会读取错误
	hqspi.Init.ClockPrescaler 	= 1;					// 时钟分频值，将QSPI内核时钟进行 1+1 分频得到QSPI通信驱动时钟
	hqspi.Init.FifoThreshold 	= 32;					// FIFO阈值
	hqspi.Init.SampleShifting	= QSPI_SAMPLE_SHIFTING_HALFCYCLE;	// 半个CLK周期之后进行采样
	hqspi.Init.FlashSize 		= 22;					// flash大小，FLASH 中的字节数 = 2^[FSIZE+1]，核心板采用是8M字节的W25Q64，这里设置为22
	hqspi.Init.ChipSelectHighTime   = QSPI_CS_HIGH_TIME_1_CYCLE;		// 片选保持高电平的时间
	hqspi.Init.ClockMode 		= QSPI_CLOCK_MODE_3;			// 模式3
	hqspi.Init.FlashID 		= QSPI_FLASH_ID_1;		        // 使用QSPI1
	hqspi.Init.DualFlash 		= QSPI_DUALFLASH_DISABLE;		// 禁止双闪存模式

	HAL_QSPI_Init(&hqspi); // 初始化配置
}
 
/*************************************************************************************************
*	函 数 名: QSPI_W25Qxx_Init
*	入口参数: 无
*	返 回 值: QSPI_W25Qxx_OK - 初始化成功，W25Qxx_ERROR_INIT - 初始化错误
*	函数功能: 初始化 QSPI 配置，读取W25Q64ID
*	说    明: 无	
*************************************************************************************************/

